#1. **Робота із словниками:**
#   Завдання: Створіть словник, що містить інформацію про вашого улюбленого спортсмена (ім'я, вік, спорт, команда тощо). Виведіть цю інформацію на екран.

athlete = {
    "ім'я": "Ліонель Мессі",
    "вік": 36,
    "спорт": "Футбол",
    "команда": "Inter Miami CF"
}
for key, value in athlete.items():
    print(f"{key}: {value}")

#2. **Оновлення словника:**
#   Завдання: Створіть словник, що містить ваші улюблені книги (назва книги та рік видання). Додайте до словника нову улюблену книгу та виведіть оновлений словник.
favorite_books = {
    "Ерін Меєр «Культурна карта»": 1877,
    "Девід Марке «Розверніть корабель»": 2021
}

favorite_books["Злочин і кара"] = 1866
print("Оновлений список улюблених книг:")
for book, year in favorite_books.items():
    print(f"{book} ({year})")

#3. **Пошук значення:**
#   Завдання: Створіть словник, що містить інформацію про країни та їх столиці. Запитайте користувача про назву країни і виведіть столицю цієї країни (якщо така країна є у словнику).
countries = {
    "Україна": "Київ",
    "Польща": "Варшава",
    "Чехія": "Прага"
}

country = input("Введіть назву країни: ")

if country in countries:
    print(f"Столиця {country}: {countries[country]}")
else:
    print("Країна не знайдена в словнику.")