#1. **Робота із списками:**
#Завдання: Створіть список чисел. Додайте до списку числа 10 і 20, видаліть число 10 і виведіть отриманий список.
numbers = [5, 15]
numbers.append(10) 
numbers.append(20)  
numbers.remove(10)  

print(numbers)  

#2. **Знаходження суми:**
#  Завдання: Створіть список чисел. Знайдіть та виведіть суму всіх чисел у списку.
numbers = [5, 10, 15, 20, 25]
total_sum = sum(numbers)

print("Сума чисел:", total_sum)

#3. **Подвійні значення:**
#  Завдання: Створіть список чисел. Подвойте кожне число у списку та виведіть результат.
numbers = [1, 2, 3, 4, 5]
doubled_numbers = [num * 2 for num in numbers]

print("Подвоєні числа:", doubled_numbers)

