#1. **Робота із кортежами:**
#   Завдання: Створіть кортеж з трьох різних предметів, таких як ("яблуко", "банан", "апельсин"). Виведіть кожен елемент кортежу окремо.
fruits = ("яблуко", "банан", "груша")

print("Перший елемент:", fruits[0])
print("Другий елемент:", fruits[1])
print("Третій елемент:", fruits[2])

#**Об'єднання кортежів:**
#   Завдання: Створіть два кортежі з числами і об'єднайте їх у новий кортеж. Виведіть отриманий кортеж.
tuple1 = (1, 2, 3)
tuple2 = (4, 5, 6)
combined_tuple = tuple1 + tuple2

print("Об'єднаний кортеж:", combined_tuple)

